{
    "Zusatzqualifikation KI und Maschinelles Lernen": "Dieser Kurs bietet die Zusatzqualifikation \"KI und Maschinelles Lernen\" an. Er wurde im Rahmen des InnoVET-Programms vom Bundesministerium für Bildung und Forschung gefördert. Hier finden Sie alle Lehrmaterialien für diesen Kurs.",
    "Spiel zum Einstieg: Bestellen Sie Eis!": "Beim Eiscreme-Spiel helfen Sie der Einzelhandelskauffrau Yvonne am Eisstand einer Tankstelle bei der Bestellung von Eis. Sie müssen möglichst genau die erwartete Absatzmenge schätzen, um einen optimalen Umsatz zu erzielen. Es gibt drei Gruppen, die entweder Tipps von Experten, Daten bisheriger Verkäufe oder mehrere Übungsmöglichkeiten erhalten.",
    "Thema A1-1: Regression": "Die Lernmaterialien zum Thema A1-1: Regression beziehen sich auf das Spiel \"Bestellen Sie Eis!\". Es gibt drei Varianten zur Auswahl: ein Erklärvideo, ein Buch mit integrierten Quizzes und Folien als PDF. Das Video erwähnt Quizzes zur Regression, die jedoch nicht direkt im Video durchgeführt werden können. Stattdessen können die Quizzes entweder im Buch oder im nächsten Abschnitt bearbeitet werden. Wenn man bereits mit Regression vertraut ist, kann dieser Abschnitt übersprungen werden.",
    "Thema A1-2: Daten und Wissen": "Der Abschnitt Thema A1-2: Daten und Wissen bezieht sich auf das Spiel \"Bestellen Sie Eis\" und die Schätzung von Eisverkäufen in drei Gruppen. Es stehen drei Materialien zur Auswahl: ein Erklärvideo, ein Buch mit integrierten Quizzes und Folien als PDF. Teilnahme am Spiel ist nicht zwingend erforderlich, um diese Materialien zu verstehen und zu bearbeiten. Falls man bereits Erfahrung mit Daten und Wissen hat, kann dieser Abschnitt übersprungen werden.",
    "Thema A2-1: Maschinelles Lernen": "In dem Abschnitt \"Maschinelles Lernen\" wird anhand eines Entscheidungsbaums erklärt, wie das Training eines Modells funktioniert. Es gibt drei verschiedene Materialien - ein Erklärvideo, ein Buch mit integrierten Quizzes und Folien als PDF -, aus denen man wählen kann. Wenn man bereits Kenntnisse im Maschinellen Lernen hat, kann man diesen Abschnitt überspringen. Im nächsten Abschnitt \"KI-Modelle\" wird erklärt, wie solche Modelle abstraktes Wissen repräsentieren und auf neue Daten angewendet werden können. Darauf aufbauend gibt es ein Praxisbeispiel zum Trainieren eines Entscheidungsbaums.",
    "Thema A2-2: KI-Modelle": "In diesem Abschnitt wird erklärt, wie ein KI-Modell wie ein trainierter Entscheidungsbaum abstraktes Wissen repräsentiert und auf neue Daten angewandt werden kann. Es gibt drei Materialien zur Auswahl, um das Thema zu vertiefen: ein Erklärvideo, ein Buch mit interaktiven Quizzes und Folien als PDF. Wenn man bereits über Kenntnisse zu KI-Modellen verfügt, kann dieser Abschnitt übersprungen werden. Im nächsten Abschnitt gibt es ein Praxisbeispiel in Gruppenarbeit, das auf den vorherigen Abschnitten aufbaut.",
    "Praxisbeispiel zu den Themen A2-1 und A2-2: Trainieren Sie einen Entscheidungsbaum": "In diesem Abschnitt wird in Gruppenarbeit ein Klassifikationsmodell, nämlich ein Entscheidungsbaum, \"von Hand\" trainiert. Die Aufgabe gehört zu den Themen A2-1 Maschinelles Lernen und A2-2 KI-Modelle. Dabei werden Trainingsdaten verwendet und anschließend der Baum auf Testdaten evaluiert. Die genaue Vorgehensweise ist im Arbeitsblatt Training eines Entscheidungsbaums beschrieben, inklusive Test- und Trainingsdaten.",
    "Thema A2-3: Trainingsdaten": "Dieser Abschnitt behandelt die Herkunft von Trainingsdaten für KI-Modelle und welche Arten von Maschinellem Lernen verschiedene Trainingsdaten erfordern. Es wird auch erklärt, was Clustering ist und warum annotierte Daten wertvoll sind. Zur Verfügung stehen drei Materialien: ein Trainingsdaten-Video, ein Trainingsdaten-Buch und als Alternative für Schnelle die Trainingsdaten-Folien als PDF. Falls man mit Trainingsdaten bereits vertraut ist, kann man den Abschnitt überspringen.",
    "Thema A3: Algorithmen": "Im Abschnitt A3 geht es um Algorithmen. Es gibt drei Materialien zur Auswahl: ein Erklärvideo, ein Buch mit integrierten Quizzes und Folien als PDF. Wählen Sie eine der Varianten aus, um sich mit dem Thema vertraut zu machen. Wenn Sie bereits Kenntnisse über Algorithmen haben, markieren Sie den Abschnitt als erledigt.",
    "Thema A4: Beispielanwendungen": "Zuerst schauen Sie sich die beiden Links zum KI-Campus an, um einen Überblick über den Einsatz von KI im Alltag und in der Industrie 4.0 zu erhalten. Danach bearbeiten Sie in Gruppen das Arbeitsblatt zu echten Anwendungsbeispielen mit konkreten Use Cases.",
    "Thema A5: Praxisprojekt Teachable Machine": "In Gruppen werden eigene kleine Projekte mit Googles Teachable Machine erstellt, wobei drei mögliche Szenarien zur Auswahl stehen: Objekterkennung in Bildern, Sounderkennung in Audioclips oder Poseerkennung in Bildern. Die Teilnehmer müssen genügend Bilder oder Audioclips generieren und hochladen, um ein KI-Modell zu trainieren. Das Projekt umfasst vier Phasen, von der Idee über die Umsetzung bis hin zur Verfeinerung des Modells, gefolgt von einem Austausch und abschließender Diskussion der Erfahrungen.",
    "Thema B1: Daten als Tabellen darstellen": "In dieser Lektion lernen Sie, mit Python Daten einzulesen und als Tabelle darzustellen. Sie können gezielt auf Zeilen, Spalten oder Zellen zugreifen und auch einige grundlegende Programmierkenntnisse und Befehle in Python erwerben. Das Lernen erfolgt entweder über ein Jupyter Notebook mit ausführbaren Befehlen und Erklärungen oder über ein weniger textbasiertes Notebook mit Video-Erklärungen. Es besteht auch die Möglichkeit, das Notebook herunterzuladen und auf dem eigenen Rechner zu bearbeiten.",
    "Thema B2: Daten in Tabellen analysieren": "In dieser Lektion lernen Sie, wie man Daten in Tabellen mit Python analysiert. Sie werden lernen, wie man die Daten einschränkt, statistische Funktionen verwendet und grundlegende Programmierkenntnisse und Befehle in Python anwendet. Das Jupyter Notebook \"Daten analysieren\" wird zur Bearbeitung verwendet, entweder über Google Colab oder durch das Herunterladen auf den eigenen Rechner.",
    "Thema B3: Daten aufbereiten": "In diesem Abschnitt lernst du, wie man Daten für Maschinelles Lernen mit Python aufbereitet. Dabei wirst du verschiedene statistische Visualisierungen kennenlernen, um Ausreißer in den Daten zu entdecken. Außerdem wirst du lernen, wie man Daten aus verschiedenen Tabellen zusammenführt. Für die Bearbeitung verwendest du entweder das Jupyter Notebook \"Daten aufbereiten\" in Google Colab oder lädst das Notebook von Github herunter. Nach dem Abschluss der Aktivität markierst du sie bitte manuell als erledigt. Wenn du interessiert bist, kannst du dir auch ein Extra-Video ansehen, in dem ein Statistik-Professor Boxplots, Median und Interquartilsabstand anhand von (erfundenen) Burgerfilialen erklärt.",
    "Thema B4: Datensicherheit": "Das Thema B4: Datensicherheit befasst sich damit, wie man Daten vor unberechtigtem Zugriff schützen kann, damit sie nicht verloren gehen oder beschädigt werden. Als größte Risiken werden Phishing-E-Mails und ein sorgloser Umgang mit Passwörtern genannt. Die Datensicherheit betrifft nicht nur Unternehmen, sondern auch den privaten Bereich. Es gibt verschiedene Maßnahmen, die jeder auf seinen eigenen Geräten ergreifen kann, um die Sicherheit seiner Daten zu gewährleisten.",
    "Thema C1-1: Das Koordinatensystem - Was ist wo?": "Der Text besagt, dass das Koordinatensystem die Grundlage zur grafischen Darstellung von Daten ist. Man kann zwischen einem Erklärvideo, einem Buch mit integrierten Quizzes oder den Folien als PDF wählen. Wenn man sich bereits mit Koordinatensystemen auskennt, kann man den Abschnitt überspringen und zum nächsten Thema übergehen. Vorher kann man noch im Buch oder im nächsten Abschnitt Quizzes zum Thema machen.",
    "Thema C1-2: Funktionen": "Funktionen sind die grundlegende Basis für Beziehungen zwischen Daten. Es gibt drei Materialien zur Auswahl: ein Erklärvideo, ein Buch mit integrierten Quizzes und Folien als PDF. Wenn man bereits mit Funktionen vertraut ist, kann man den Abschnitt überspringen und zum nächsten Thema übergehen.",
    "Thema C1-3: Lineare Funktionen - Steigung": "In diesem Abschnitt, Thema C1-3: Lineare Funktionen - Steigung, hast du drei Materialien zur Auswahl, um das Thema zu lernen: ein Erklärvideo, ein Buch mit integrierten Quizzes und Folien als PDF. Du kannst einen der drei Varianten auswählen und falls du das Thema schon beherrscht, kannst du es überspringen. Das nächste Thema, D1-4: Lineare Funktionen - y-Achsenabschnitt, wird freigeschaltet, nachdem du die Quizzes zum Thema Steigung gemacht hast.",
    "Thema C1-4: Lineare Funktionen - y-Achsenabschnitt": "Wählen Sie eines der drei Materialien (Video, Buch mit integrierten Quizzes oder PDF-Folien) zur Erklärung des y-Achsenabschnitts bei linearen Funktionen aus. Wenn Sie bereits mit dem y-Achsenabschnitt vertraut sind, können Sie diesen Abschnitt überspringen und direkt mit den Quizzes zum Thema y-Achsenabschnitt fortfahren.",
    "Thema C2-1: Scatterplots": "Der Abschnitt Thema C2-1 behandelt Scatterplots. Zuerst kannst du dir entweder das Erklärvideo oder das Buch zu Scatterplots anschauen, um das Konzept zu verstehen. Im anschließenden Jupyter Notebook lernst du, wie du Scatterplots mit Python erstellen kannst und findest dazu Übungsaufgaben. Die Lösungen kannst du mit den Quizzes im nächsten Abschnitt überprüfen. Wenn du keinen Google Account hast, kannst du das Notebook alternativ von Github herunterladen. Beachte jedoch, dass du vorher die Abschnitte B1, B2 und B3 zu Daten durchgearbeitet haben solltest, um den Umgang mit Jupyter Notebooks und das Lesen von Python-Code zu beherrschen.",
    "Thema C2-2: Mittelwert und Standardabweichung": "In diesem Abschnitt geht es um den Mittelwert und die Standardabweichung. Die Standardabweichung misst, wie stark die Daten vom Mittelwert abweichen. Schaue dir zuerst das Erklärvideo oder das Buch dazu an und dann berechne die Beispiele im Jupyter Notebook. Als Übung kannst du die Standardabweichung von Iris Setosa und Iris Virginica berechnen. Überprüfe dann deine Lösung mit dem Quiz im nächsten Abschnitt. Bearbeite das Notebook nur, wenn du bereits die vorherigen Themen zu Daten und Jupyter Notebooks durchgearbeitet hast.",
    "Thema C2-3: Korrelation": "Der Abschnitt Thema C2-3 beschäftigt sich mit dem Thema Korrelation. Es wird erklärt, wie man herausfinden kann, ob ein Zusammenhang zwischen zwei Faktoren besteht und wie stark dieser ist. Dazu werden der Korrelationskoeffizient nach Pearson und die Kovarianz erklärt. Außerdem wird gezeigt, wie man den Koeffizienten interpretieren kann und dass Korrelationen nicht unbedingt eine Ursache-Wirkung-Beziehung darstellen.",
    "Thema C3-1: Einfache Lineare Regression": "Im Abschnitt Thema C3-1 geht es um die einfache lineare Regression. Es wird empfohlen, entweder das Erklärvideo oder das Buch zur einfachen linearen Regression anzusehen. Im Jupyter Notebook \"Einfache Lineare Regression mit sklearn\" findet man Berechnungen zu den Beispielen aus dem Video/Buch sowie eine Übung zur Berechnung eines linearen Regressionsmodells. Alternativ kann man auch das Notebook von GitHub herunterladen. Die Lösungen werden im Quiz im nächsten Abschnitt überprüft. Beachten Sie jedoch, dass das Notebook nur für Personen zugänglich ist, die bereits Erfahrung mit Notebooks haben und das Notebook zum Thema B3 bearbeitet haben.",
    "Thema C3-2: Multiple Lineare Regression": "In Thema C3-2 geht es um die Erweiterung der linearen Regression, um mehrere erklärende Variablen verwenden zu können. Dabei werden manchmal auch kategoriale Variablen in Dummyvariablen umgewandelt. Das Prinzip wird in einem Erklärvideo und einem Buch erklärt. Im Jupyter Notebook gibt es Beispiele für die Verwendung von mehreren Variablen, einschließlich kategorialer Variablen. Es gibt auch Aufgaben am Ende des Notebooks, um das Gelernte anzuwenden.",
    "Thema C4-1: Klassifikationsbäume": "In diesem Abschnitt geht es um Klassifikationsbäume, die mit Hilfe von Maschinellem Lernen aus Daten gelernt wurden. Es wird erklärt, dass der Baum so aufgebaut sein sollte, dass an den Blättern möglichst nur noch Daten einer Klasse vorkommen. Außerdem wird der Gini-Index vorgestellt, der die Diversität der Klassen in jedem Knoten des Baums misst.",
    "Thema C4-2: Entropie": "Im Abschnitt C4-2 geht es um die Entropie, welche ähnlich wie der Gini-Index ein Maß für Unordnung oder Unsicherheit ist. Die Entropie wird im nächsten Abschnitt C4-3 verwendet, um zu messen, wie viel Information durch den Klassifikationsbaum gewonnen wird. Es stehen drei verschiedene Materialien zur Verfügung, um das Thema zu erlernen.",
    "Thema C4-3: Training von Klassifikationsbäumen": "In diesem Abschnitt wird das Training von Klassifikationsbäumen behandelt. Es wird erklärt, wie der Algorithmus zum Bauen von Entscheidungsbäumen funktioniert und welche Parameter dabei wichtig sind, um Overfitting zu vermeiden. Es gibt zwei Jupyter Notebooks, die den Prozess des Baumtrainings und die verfügbaren Parameter in sklearn illustrieren. Die Lösungen zu den darin enthaltenen Aufgaben finden Sie im nächsten Abschnitt.",
    "Thema C5-1: Evaluationsmaße": "Das Thema Evaluationsmaße behandelt die Bewertung von KI-Modellen, um sie vergleichen zu können. Klassifikationsmodelle werden anders evaluiert als Regressionsmodelle. Im Erklärvideo und den Folien erhalten Sie einen Überblick über die Evaluierung beider Modellarten. Anschließend besteht die Möglichkeit, im Jupyter Notebook selbst Klassifikationsmodelle zu evaluieren.",
    "Thema C5-2: Training und Test": "In diesem Abschnitt geht es um die Aufteilung von Daten in Training und Test für eine objektive Evaluierung von KI-Modellen. Es wird erklärt, warum diese Aufteilung wichtig ist und worauf dabei geachtet werden sollte. Nachdem man das Notebook zur Aufteilung mit sklearn durchgeführt hat, stehen verschiedene Materialien zur Verfügung, um das Thema weiter zu vertiefen.",
    "Thema C5-3: Cross-Validierung": "Cross-Validierung oder Kreuzvalidierung ist eine Methode zur Evaluierung von KI-Modellen, die hilft, die Testdatenproblematik zu umgehen. Statt nur eine einmalige Testdatenmenge zu verwenden, wird der Datensatz in mehrere Teile aufgeteilt. Dabei wird das Modell mehrmals trainiert und jeweils mit einem anderen Teil der Daten getestet. Dies ermöglicht eine objektivere Bewertung der Modellleistung und reduziert das Risiko von zufällig einfachen oder schwierigen Testdaten.",
    "Thema C6-1: Distanzfunktionen": "In diesem Abschnitt geht es um Distanzfunktionen beim Maschinellen Lernen. Ähnliche Datenpunkte haben ähnliche Eigenschaften, und ihre Ähnlichkeit ergibt sich aus der Distanz zwischen ihnen, also wie nahe sie sich im Koordinatensystem befinden. Der Abschnitt stellt verschiedene Materialien vor, um zu lernen, wie man die Distanz zwischen Datenpunkten berechnet, einschließlich eines Videos, eines Buchs und einer PDF-Datei. Es gibt auch ein Jupyter Notebook, um Distanzfunktionen in der Praxis anzuwenden, sowie Quizzes zur Überprüfung des Verständnisses.",
    "Thema C6-2: Instanzbasiertes Lernen": "Das instanzbasierte Lernen nutzt die Ähnlichkeit von Datenpunkten, um Vorhersagen zu treffen. Dabei werden ähnliche Datenpunkte in den Trainingsdaten identifiziert. Ein bekanntes Verfahren ist die Nächste-Nachbarn-Klassifikation bzw. Regression. Es besteht die Möglichkeit, dies im Jupyter Notebook mit sklearn selbst auszuprobieren. Es gibt auch ein Regressionsproblem, das mit Nächste-Nachbarn-Regression gelöst werden kann.",
    "Thema C7-1: Neuronen": "Der Abschnitt \"Neuronen\" behandelt den Aufbau und die Verbindung von Neuronen zu neuronalen Netzen. Dies ist besonders relevant für das Verständnis der Linearen Regression. Es gibt verschiedene Optionen zur Verfügung, um sich über Neuronen zu informieren, einschließlich eines Videos, eines Buches oder der Folien als PDF.",
    "Thema C7-2: Aktivierungsfunktionen": "Hier erfahren Sie, welche Aktivierungsfunktionen oft in Neuronalen Netzen verwendet werden. Sie können zwischen einem Erklärvideo, einem Buch oder Folien als PDF wählen, um das Thema zu bearbeiten. Wenn Sie bereits mit Aktivierungsfunktionen vertraut sind, können Sie diesen Abschnitt überspringen.",
    "Thema C7-3: Parameter in Neuronalen Netzen": "In diesem Abschnitt geht es um die Parameter in Neuronalen Netzen und den sogenannten Forward Pass. Wir sehen uns an, welche Parameter im Training eines Neuronalen Netzes gelernt werden müssen und wie Vorhersagen für einen gegebenen Input berechnet werden. Es gibt drei Materialien zur Auswahl, um sich mit diesem Thema auseinanderzusetzen. Wenn das Thema bereits bekannt ist, kann es übersprungen werden.",
    "Thema C7-4: Training von Neuronalen Netzen": "In diesem Abschnitt geht es darum zu verstehen, wie neuronale Netze trainiert werden. Das Ziel des Trainings ist es, die Gewichte an den neuronalen Verbindungen so anzupassen, dass das Netz \"gut genug\" ist. Zusätzlich spielen auch Hyperparameter eine Rolle, die in weiteren Materialien näher erklärt werden. ",
    "Thema C7-5: Verlustfunktion": "In diesem Abschnitt geht es um die Verlustfunktionen, die beim Training von neuronalen Netzen verwendet werden. Es wird erläutert, welche Verlustfunktionen geeignet sind und wie man sie für die einzelnen Parameter berechnet. Die Quizzes zum Thema Verlustfunktion finden Sie im folgenden Abschnitt.",
    "Thema C7-6: Netzwerkarchitekturen": "Dieser Abschnitt behandelt verschiedene komplexe neuronale Netzwerkarchitekturen wie RNNs, LSTMs und Encoder-Decoder-Architekturen. Sie gehören zu den leistungsfähigsten Architekturen und sind weniger ressourcenintensiv als die Transformer-Architektur. Es werden Links zu weiteren Informationen und Quizzes zum Thema bereitgestellt.",
    "Thema D1: Datenschutz": "In diesem Abschnitt geht es um die Bedeutung des Datenschutzes für uns als Verbraucher*innen. Sie werden verschiedene Ressourcen wie Videos und Arbeitsblätter nutzen, um mehr über Datenschutzregeln und -skandale zu erfahren. Es wird auch aufgezeigt, dass Daten mittlerweile eine wertvolle Ware geworden sind. Das Thema Datenschutz wird auch im nächsten Abschnitt über algorithmischen Bias noch einmal aufgegriffen.",
    "Thema D2: Algorithmischer Bias": "Der Abschnitt Thema D2 behandelt den algorithmischen Bias, also die Voreingenommenheit von Algorithmen. Dabei wird erklärt, wie Vorurteile in den Trainingsdaten zu Benachteiligungen führen können. Die Schülerinnen und Schüler experimentieren mit einem Teachable-Machine-Projekt und diskutieren anhand eines TED-Talks mögliche Lösungsansätze zur Reduzierung von Bias. Abschließend füllen sie ein Arbeitsblatt zum Thema aus.",
    "Thema D3: Erklärbarkeit": "Neuronale Netzwerke gelten aufgrund ihrer vielen Parameter als Black-Box-Modelle, die schwer interpretierbar sind. Dies kann insbesondere im Hinblick auf Fairness problematisch sein. In diesem Abschnitt werden die begrenzte Interpretierbarkeit von neuronalen Netzen, sowie der Vergleich mit linearen Regressionsmodellen und Entscheidungsbäumen behandelt.",
    "Juhu, geschafft!": "Sie haben den KI-B3 Kurs erfolgreich abgeschlossen, der in Zusammenarbeit mit verschiedenen IHKs und Universitäten entwickelt wurde und vom Bundesministerium für Bildung und Forschung gefördert wurde. Die Universität München wird das Projekt weiterhin begleiten und in Teilnehmerbefragungen evaluieren. Wenn Sie möchten, können Sie anonymisierte Logdaten zur Verfügung stellen, um die Inhalte des Kurses zu verbessern. Viel Glück für die Zukunft und wir hoffen, dass Ihnen der Kurs Spaß gemacht hat! Sie dürfen das Kursmaterial gerne weitergeben, allerdings unter Angabe der Autor*innennamen und Beachtung der Lizenzhinweise."
}