{
    "Zusatzqualifikation KI und Maschinelles Lernen": "Der Kurs \"KI und Maschinelles Lernen\" ist eine Zusatzqualifikation, die vom Bundesministerium für Bildung und Forschung im Rahmen des InnoVET-Programms gefördert wird. Hier finden Sie alle Lehrmaterialen für den Kurs. Willkommen!",
    "Spiel zum Einstieg: Bestellen Sie Eis!": "Beim Spiel \"Bestellen Sie Eis!\" helfen Sie der Einzelhandelskauffrau Yvonne am Eisstand einer Tankstelle bei der Bestellung von Eis. Ihr Ziel ist es, die Absatzmenge möglichst genau zu schätzen, um den Umsatz zu maximieren und Eisverschwendung zu vermeiden. Es gibt drei Gruppen: Gruppe 1 erhält Tipps von Experten, Gruppe 2 bekommt Daten bisheriger Verkäufe und Gruppe 3 kann mehrfach üben. Achten Sie darauf, dass die Gruppenauswahl nicht rückgängig gemacht werden kann.",
    "Thema A1-1: Regression": "Dieser Abschnitt behandelt das Thema \"Regression\". Es bezieht sich auf das Spiel \"Bestellen Sie Eis!\", aber es ist nicht notwendig, daran teilgenommen zu haben, um den Inhalt zu verstehen. Es gibt drei Materialien zur Auswahl: ein Erklärvideo, ein Buch mit integrierten Quizzes und Folien als PDF. Wählen Sie eine der Optionen aus. Beachten Sie jedoch, dass Sie die Quizzes im Video nicht direkt absolvieren können. Stattdessen können Sie entweder die Folien im Buch durchklicken und die Quizzes bearbeiten oder die Quizzes im nächsten Abschnitt absolvieren. Wenn Sie bereits mit Regression vertraut sind, können Sie diesen Abschnitt überspringen.",
    "Thema A1-2: Daten und Wissen": "In diesem Abschnitt geht es um das Thema \"Daten und Wissen\", das sich auf das Spiel \"Bestellen Sie Eis\" bezieht. Es gibt drei verschiedene Materialien zur Auswahl, nämlich ein Erklärvideo, ein Buch mit integrierten Quizzes und Folien als PDF-Dokument. Man kann die Materialien unabhängig vom Spiel nutzen und es ist möglich, diesen Abschnitt zu überspringen, falls man bereits mit dem Thema vertraut ist.",
    "Thema A2-1: Maschinelles Lernen": "Der Abschnitt Thema A2-1 beschäftigt sich mit maschinellem Lernen, genauer gesagt mit dem Training eines Modells anhand eines Entscheidungsbaums. Es gibt drei Materialien zur Auswahl: ein Erklärvideo, ein Buch mit integrierten Quizzes und Folien als PDF. Eine der Varianten sollte durchgemacht werden. Wenn man bereits mit maschinellem Lernen vertraut ist, kann dieser Abschnitt übersprungen werden. Im nächsten Abschnitt KI-Modelle wird erklärt, wie ein solches Modell abstraktes Wissen darstellt und auf neue Daten angewandt werden kann. Abschließend wird ein Praxisbeispiel vorgestellt, das auf den vorherigen Abschnitten basiert: das Trainieren eines Entscheidungsbaums.",
    "Thema A2-2: KI-Modelle": "Im Abschnitt \"KI-Modelle\" wird erklärt, wie ein Modell wie der zuvor trainierte Entscheidungsbaum abstraktes Wissen repräsentiert und wie es auf neue Daten angewendet werden kann. Es stehen drei Materialien zur Verfügung: ein Erklärvideo, ein Buch mit integrierten Quizfragen und Folien als PDF. Bitte wähle eine der Varianten aus. Wenn du bereits mit KI-Modellen vertraut bist, kannst du diesen Abschnitt überspringen. Anschließend gibt es ein Praxisbeispiel in Gruppenarbeit, das auf diesen beiden Abschnitten aufbaut (Praxisbeispiel zu den Themen A2-1 und A2-2: Trainieren Sie einen Entscheidungsbaum).",
    "Praxisbeispiel zu den Themen A2-1 und A2-2: Trainieren Sie einen Entscheidungsbaum": "In diesem Abschnitt trainieren Sie in Gruppenarbeit einen Entscheidungsbaum als Klassifikationsmodell. Dieses Training gehört zu den Themen A2-1 Maschinelles Lernen und A2-2 KI-Modelle. Mithilfe von Trainingsdaten erstellen Sie den Entscheidungsbaum und evaluieren ihn anschließend mit Testdaten. Bitte schauen Sie vorher das Video zum Maschinellen Lernen in Abschnitt A2-1 und das Video zu KI-Modellen in Abschnitt A2-2 an, um sich entsprechend zu informieren. Alle Details zur Vorgehensweise und die benötigten Test- und Trainingsdaten finden Sie im Arbeitsblatt Training eines Entscheidungsbaums.",
    "Thema A2-3: Trainingsdaten": "In diesem Abschnitt geht es um Trainingsdaten für KI-Modelle. Sie lernen, woher diese Daten stammen und welche Art von Maschinellem Lernen welche Trainingsdaten benötigt. Außerdem erfahren Sie, was Clustering ist und warum annotierte Daten wertvoll sind. Sie haben die Wahl zwischen drei Materialien: ein Video, ein Buch und Folien als PDF. Wenn Sie bereits mit Trainingsdaten vertraut sind, können Sie den Abschnitt überspringen.",
    "Thema A3: Algorithmen": "In diesem Abschnitt geht es um Algorithmen. Du hast drei Möglichkeiten zur Auswahl, um das Thema zu erlernen: \n\n1. Schau dir das Erklärvideo über Algorithmen an.\n2. Lese das Buch über Algorithmen, das direkt integrierte Quizzes zum Selbst-Durchklicken enthält.\n3. Als Alternative für Schnelle gibt es die Folien als PDF. \n\nWähle eine der drei Varianten aus und arbeite damit. Wenn du bereits mit Algorithmen vertraut bist, kannst du diesen Abschnitt überspringen, indem du ihn als erledigt markierst und angibst: \"Algorithmen kann ich schon, bitte überspringen!\"",
    "Thema A4: Beispielanwendungen": "Besuchen Sie den KI-Campus, um mehr über den Einsatz von KI im Alltag und in der Industrie 4.0 zu erfahren. Bearbeiten Sie dann in Gruppen das Arbeitsblatt mit echten Use Cases.",
    "Thema A5: Praxisprojekt Teachable Machine": "In dem Praxisprojekt Teachable Machine gestalten die Schüler in Gruppen eigene kleine Projekte mit Hilfe von Googles Teachable Machine. Dabei haben sie die Wahl zwischen drei Szenarien: dem Erkennen von Objekten in Bildern, dem Erkennen von Sounds in Audioclips und dem Erkennen von Posen in Bildern. Für jedes Szenario erstellen die Schüler ausreichend Bilder bzw. Audioclips, um ein KI-Modell zu trainieren. Diese Modelle werden automatisch erstellt und können anschließend auf neuen Bildern bzw. Audioclips getestet werden. Das Projekt ist in vier Phasen aufgeteilt: Ideenfindung, Umsetzung des ersten KI-Modells, Verfeinerung des Projekts und Austausch der Modelle untereinander zur Überprüfung der Robustheit. Abschließend werden die Erfahrungen diskutiert.",
    "Thema B1: Daten als Tabellen darstellen": "In dieser Lektion lernen Sie, wie Sie mit Python Daten als Tabellen darstellen und darauf zugreifen können. Sie werden grundlegende Programmierkenntnisse und Befehle in Python kennenlernen. Dafür verwenden Sie ein Jupyter Notebook, in dem die Python-Befehle erklärt werden. Sie können die Befehle ausführen und experimentieren. Sie haben verschiedene Möglichkeiten, das Notebook anzusehen und zu bearbeiten, zum Beispiel über Google Colab, ein Jupyter Notebook-Server oder den Download des Notebooks von Github.",
    "Thema B2: Daten in Tabellen analysieren": "In diesem Abschnitt lernen Sie, wie Sie Daten in Tabellen mithilfe von Python analysieren. Sie erfahren, wie Sie die Daten innerhalb einer Tabelle eingrenzen und einfache statistische Funktionen wie den Mittelwert oder die Anzahl der Datenpunkte berechnen können. Nebenbei erlernen Sie grundlegende Programmierkenntnisse und Befehle in Python. Sie verwenden ein Jupyter Notebook, entweder über Google Colab oder indem Sie es auf Ihrem eigenen Rechner installieren.",
    "Thema B3: Daten aufbereiten": "Der Text beschreibt das Thema B3, bei dem es um die Aufbereitung von Daten für Maschinelles Lernen mit Python geht. Dabei lernt man statistische Visualisierungen wie Histogramme und Boxplots kennen, um Ausreißer in den Daten zu entdecken. Außerdem lernt man, Daten aus verschiedenen Tabellen zusammenzuführen. Die praktische Arbeit erfolgt mit einem Jupyter Notebook, entweder über Google Colab oder durch Herunterladen eines Notebooks von Github. Eine optionale Aktivität ist das Anschauen eines Videos zu Boxplots, Median und Interquartilsabstand von einem Statistik-Professor.",
    "Thema B4: Datensicherheit": "Das Thema B4: Datensicherheit beschäftigt sich mit dem Schutz von Daten. Dabei geht es darum, dass Daten nicht von Unbefugten eingesehen werden können, nicht beschädigt werden und immer verfügbar sind. Dies ist besonders wichtig, da Daten wertvolles Wissen enthalten. Im Hinblick auf Angriffe von außen sind Phishing-E-Mails und ein unsicherer Umgang mit Passwörtern die größten Risiken. Es gibt einige Maßnahmen, die ergriffen werden können, um die Datensicherheit zu gewährleisten. Es ist nicht nur im Unternehmen wichtig, sondern auch auf privaten Geräten.",
    "Thema C1-1: Das Koordinatensystem - Was ist wo?": "In diesem Abschnitt geht es um das Koordinatensystem, das die Grundlage zur grafischen Darstellung von Daten bildet. Du hast die Wahl zwischen drei Materialien: einem Erklärvideo, einem Buch mit integrierten Quizzes und Folien als PDF. Wähle eine Variante aus, um mehr über das Koordinatensystem zu erfahren. Wenn du bereits mit Koordinatensystemen vertraut bist, kannst du diesen Abschnitt überspringen und zum nächsten übergehen. Dort findest du auch weitere Quizzes zum Thema Koordinatensystem.",
    "Thema C1-2: Funktionen": "In diesem Abschnitt geht es um Funktionen, die die Grundlage für Beziehungen zwischen Daten bilden. Es stehen drei Materialien zur Auswahl: ein Erklärvideo, ein Buch mit integrierten Quizzes sowie Folien als PDF. Wenn man sich bereits mit Funktionen auskennt, kann man diesen Abschnitt überspringen und zur nächsten Themenbereich \"Lineare Funktionen - Steigung\" wechseln. Vorher besteht jedoch die Möglichkeit, die Quizzes zum Thema Funktionen zu machen, entweder im Buch oder im nächsten Abschnitt.",
    "Thema C1-3: Lineare Funktionen - Steigung": "Im Abschnitt \"Thema C1-3: Lineare Funktionen - Steigung\" haben Sie drei Materialien zur Auswahl, um das Thema zu lernen: ein Erklärvideo, ein Buch mit integrierten Quizzes und Folien als PDF für Schnelle. Wenn Sie bereits mit der Steigung bei linearen Funktionen vertraut sind, können Sie diesen Abschnitt überspringen und zum nächsten Thema übergehen. Vorher haben Sie jedoch die Möglichkeit, die Quizzes zur Steigung zu machen. Diese finden Sie entweder im Buch oder im nächsten Abschnitt.",
    "Thema C1-4: Lineare Funktionen - y-Achsenabschnitt": "Wählen Sie eine der drei Materialien aus: ein Erklärvideo, ein Buch mit eingebetteten Quizzes oder Folien als PDF. Wenn Sie den y-Achsenabschnitt von linearen Funktionen bereits beherrschen, können Sie diesen Abschnitt überspringen. Sie können anschließend die Quizzes zum y-Achsenabschnitt machen, entweder im Buch oder im nächsten Abschnitt.",
    "Thema C2-1: Scatterplots": "Der Abschnitt Thema C2-1 handelt von Scatterplots oder Streudiagrammen. Zuerst wird empfohlen, entweder das Erklärvideo oder das Buch über Scatterplots anzuschauen. Anschließend können im Jupyter Notebook \"Streudiagramme selbst erstellen\" Erklärungen dazu gefunden werden, wie man solche Diagramme mit Python erstellt. Es gibt auch Aufgaben, deren Lösungen mit den Quizzes im nächsten Abschnitt überprüft werden können. Alternativ kann das Notebook von Github heruntergeladen werden, falls kein Google Account genutzt werden möchte. Es wird empfohlen, vorher die Themen B1, B2 und B3 zu Daten zu bearbeiten, um Erfahrung im Umgang mit Jupyter Notebooks und dem Lesen von (Python-)Programmiercode zu sammeln. Die restlichen Materialien sind jedoch auch ohne diese Themen zugänglich.",
    "Thema C2-2: Mittelwert und Standardabweichung": "In diesem Abschnitt geht es um den Mittelwert und die Standardabweichung. Die Standardabweichung misst, wie stark die Daten von ihrem Mittelwert abweichen. Zuerst sollten Sie das Erklärvideo oder das Buch zum Mittelwert und zur Standardabweichung ansehen. Anschließend können Sie die Berechnungen und Aufgaben im Jupyter Notebook durchführen. Um Ihre Lösungen zu überprüfen, steht Ihnen ein Quiz zur Verfügung. Bitte stellen Sie sicher, dass Sie vorher die Themen B1, B2 und B3 zu Daten durchgearbeitet haben, um den Umgang mit Jupyter Notebooks und die Analyse von Daten mit pandas zu verstehen. Nur dann können Sie das Notebook bearbeiten.",
    "Thema C2-3: Korrelation": "In diesem Abschnitt geht es um das Thema Korrelation. Es wird untersucht, ob ein Zusammenhang zwischen zwei Faktoren besteht. Es wird erklärt, dass der Korrelationskoeffizient den Zusammenhang erfasst. Es werden verschiedene Videos angeboten, die die Konzepte der Korrelation, der Kovarianz und des Korrelationskoeffizienten erklären. Dabei ist es wichtig, die Berechnungen zu verstehen, aber nicht selbst durchführen zu können. Zudem wird gezeigt, wie der Korrelationskoeffizient interpretiert werden kann. Das Arbeitsblatt thematisiert, dass Korrelationen manchmal zufällig entstehen und dass sie nicht unbedingt auf eine Kausalität hinweisen.",
    "Thema C3-1: Einfache Lineare Regression": "Dieser Abschnitt behandelt die einfache lineare Regression. Zuerst solltest du das Erklärvideo oder das Buch zum Thema anschauen. Im Jupyter Notebook findest du dann die Berechnungen zu den Beispielen aus dem Video/Buch sowie eine Aufgabe zur Berechnung eines linearen Regressionsmodells. Du kannst auch die Aktivität herunterladen, um die Lösung zu überprüfen. Im nächsten Abschnitt kannst du dein Wissen mit einem Quiz zum Thema testen. Beachte jedoch, dass das Notebook nur verfügbar ist, wenn du bereits Erfahrung damit hast und mindestens das Notebook zum Thema B3 bearbeitet hast.",
    "Thema C3-2: Multiple Lineare Regression": "In diesem Abschnitt geht es um die erweiterte lineare Regression mit mehreren erklärenden Variablen. Hierbei können auch kategoriale Variablen verwendet werden, die in Dummyvariablen umgewandelt werden. Das Prinzip wird in einem Erklärvideo oder Buch erklärt. Es gibt auch Beispiele im Jupyter Notebook, bei denen mehrere Variablen verwendet werden. Am Ende des Notebooks gibt es Aufgaben, um das Gelernte anzuwenden. Die Lösungen können im nächsten Abschnitt überprüft werden.",
    "Thema C4-1: Klassifikationsbäume": "In diesem Abschnitt geht es um Klassifikationsbäume, die mithilfe des Maschinellen Lernens aus Daten erstellt werden. Ziel ist es, den Baum so aufzubauen, dass an den Blättern möglichst nur noch Daten einer Klasse vorkommen. Der Gini-Index wird als Maß verwendet, um die Diversität der Klassen in jedem Knoten zu bestimmen. Sie haben die Wahl zwischen einem Erklärvideo, einem interaktiven Buch oder Folien als PDF, um die theoretischen Grundlagen zu lernen. Anschließend können Sie mit dem Jupyter Notebook lernen, wie Sie selbst einen Klassifikationsbaum erstellen können. Die Lösungen finden Sie im Quizz zum Thema.",
    "Thema C4-2: Entropie": "Der Abschnitt Thema C4-2 behandelt die Entropie. Wie der Gini-Index bei Klassifikationsbäumen ist die Entropie ein Maß für \"Unordnung\" oder Unsicherheit. Im nächsten Abschnitt C4-3 wird die Entropie als Maß dafür genutzt, wie viel Information durch den Baum gewonnen wird. Zur Verfügung stehen drei Materialien: ein Video zur Entropie, ein Buch zum selbst Durchklicken und Folien als PDF für eine schnelle Alternative.",
    "Thema C4-3: Training von Klassifikationsbäumen": "Der Abschnitt Thema C4-3: Training von Klassifikationsbäumen gibt einen detaillierten Einblick in den Prozess des Erstellens von Entscheidungsbäumen. Es werden wichtige Parameter erklärt, die beim Training von Klassifikationsbäumen hilfreich sind, insbesondere um Overfitting zu vermeiden. Es werden zwei Jupyter Notebooks bereitgestellt: \"Training von Klassifikationsbäumen verstehen mit sklearn\" und \"Parameter beim Training von Klassifikationsbäumen mit sklearn\", die den Prozess des Baumtrainings und die zur Verfügung stehenden Parameter anschaulich darstellen. Es wird empfohlen, beide Notebooks durchzuarbeiten, um ein umfassendes Verständnis zu erlangen. Die Lösungen für die Aufgaben in den Notebooks befinden sich im nächsten Abschnitt \"Quizzes zum Thema C4-3: Training von Klassifikationsbäumen\".",
    "Thema C5-1: Evaluationsmaße": "Das Thema \"Evaluationsmaße\" behandelt die Bewertung von KI-Modellen, um sie vergleichen zu können. Es gibt unterschiedliche Evaluationsmaße für Klassifikations- und Regressionsmodelle. Im Erklärvideo und den Folien erhalten Sie eine Übersicht über die Evaluierung beider Arten von Modellen. Im Jupyter Notebook können Sie Klassifikationsmodelle evaluieren. Sie können es entweder über Google Colab aufrufen oder das Notebook von Github herunterladen.",
    "Thema C5-2: Training und Test": "In diesem Abschnitt geht es um die Aufteilung von Daten in Trainings- und Testdaten für eine objektive Evaluierung von KI-Modellen. Es wird erklärt, warum diese Aufteilung wichtig ist und worauf man dabei achten sollte. Es wird empfohlen, zuerst das Notebook \"Aufteilung in Training und Test mit sklearn\" durchzuarbeiten und anschließend eine der zur Auswahl stehenden Materialien zu nutzen, um weitere Informationen zu erhalten.",
    "Thema C5-3: Cross-Validierung": "Cross-Validierung, oder Kreuzvalidierung, ist eine Methode zur Evaluierung von KI-Modellen, wenn nur begrenzte Daten zur Verfügung stehen. Anstatt Testdaten zurückzuhalten, wird der verfügbare Datensatz in mehrere Teile aufgeteilt. Das Modell wird dann mehrere Male trainiert und getestet, wobei verschiedene Teile der Daten als Testdaten verwendet werden. Dies ermöglicht eine zuverlässigere Evaluierung des Modells, da sowohl \"einfache\" als auch \"schwierige\" Testdaten berücksichtigt werden.",
    "Thema C6-1: Distanzfunktionen": "Im Abschnitt Thema C6-1 geht es um Distanzfunktionen. Beim Maschinellen Lernen nutzen wir die Tatsache aus, dass ähnliche Datenpunkte ähnliche Eigenschaften haben. Um festzustellen, wie ähnlich sich Datenpunkte sind, berechnen wir den Abstand zwischen ihnen. In diesem Abschnitt lernen Sie, wie man Distanzfunktionen verwendet, um den Abstand zwischen Datenpunkten zu berechnen. Es gibt verschiedene Materialien zur Auswahl, wie ein Video, ein Buch oder Folien als PDF. Anschließend können Sie in einem Jupyter Notebook Distanzfunktionen in der Praxis anwenden. Sie finden auch Quizzes zu den theoretischen Inhalten und die Lösungen zu den Aufgaben aus dem Notebook.",
    "Thema C6-2: Instanzbasiertes Lernen": "Instanzbasiertes Lernen ist ein einfaches Lernverfahren, bei dem ähnliche Datenpunkte in den Trainingsdaten für die Vorhersage genutzt werden. Dabei wird die Nächste-Nachbarn-Klassifikation oder -Regression angewendet. Im Jupyter Notebook können Sie die Nächste-Nachbarn-Klassifikation und -Regression mit sklearn ausprobieren.\n",
    "Thema C7-1: Neuronen": "Im Abschnitt \"Neuronen\" wird das Thema neuronale Netze und deren Verbindung zu linearer Regression erklärt. Es wird der Aufbau von Neuronen und deren Verbindungen zu neuronalen Netzen behandelt. Zur Auswahl stehen ein Video, ein Buch oder Folien als PDF, um weitere Informationen zu erhalten.",
    "Thema C7-2: Aktivierungsfunktionen": "Der Abschnitt Thema C7-2 handelt von Aktivierungsfunktionen in Neuronalen Netzen. Es werden drei Varianten zur Auswahl angeboten: ein Erklärvideo, ein Buch oder Folien als PDF. Man kann eine der Varianten auswählen oder das Thema überspringen, falls man bereits mit Aktivierungsfunktionen vertraut ist.",
    "Thema C7-3: Parameter in Neuronalen Netzen": "Im Abschnitt Thema C7-3 geht es um die Parameter innerhalb von neuronalen Netzen und den sogenannten Forward Pass. Dabei wird erklärt, welche Parameter während des Trainings gelernt werden müssen und wie der Forward Pass funktioniert. Es gibt drei Materialien zur Auswahl: ein Video, ein Buch und Folien als PDF. Wenn man sich bereits gut mit dem Thema auskennt, kann man es überspringen.",
    "Thema C7-4: Training von Neuronalen Netzen": "Im Abschnitt Thema C7-4 geht es um das Training von neuronalen Netzen. Um ein neuronales Netz \"gut genug\" zu machen, müssen die Gewichte an den Verbindungen verändert werden. Neben den Gewichten spielen auch sogenannte Hyperparameter eine Rolle. Es stehen verschiedene Materialien zur Verfügung, um mehr über das Training und die Hyperparameter zu erfahren. Im Anschluss gibt es Quizzes zum Thema.",
    "Thema C7-5: Verlustfunktion": "In diesem Abschnitt geht es um Verlustfunktionen beim Training von neuronalen Netzen. Es wird erklärt, welche Verlustfunktionen geeignet sind und wie man ihre Gradienten für die einzelnen Parameter berechnet. Es stehen verschiedene Materialien wie Videos, Bücher und Folien als PDF zur Verfügung. Im nächsten Abschnitt gibt es Quizzes zum Thema Verlustfunktion.",
    "Thema C7-6: Netzwerkarchitekturen": "In diesem Abschnitt werden komplexe Architekturen von neuronalen Netzen behandelt: RNNs, LSTMs und die Encoder-Decoder-Architektur. Diese Architekturen sind leistungsfähig und weniger ressourcenintensiv als die Transformer-Architektur. Zu den RNNs und LSTMs gibt es Videos, Bücher und Folien als PDF. Zur Encoder-Decoder-Architektur gibt es ebenfalls Videos, Bücher und Folien als PDF. Nach den Quizzes zu Netzwerkarchitekturen geht es im nächsten Abschnitt um Datenschutz.",
    "Thema D1: Datenschutz": "In diesem Abschnitt geht es um Datenschutz und warum er für uns als Verbraucher wichtig ist. Es werden verschiedene Videos und Arbeitsblätter empfohlen, um mehr darüber zu erfahren. Zuerst gibt es eine Playlist zum Thema Datenschutz, die angesehen und bearbeitet werden kann. Dann werden die europäischen Datenschutzregeln näher betrachtet, dafür gibt es ein Video von einem Berufsschullehrer und eine Playlist mit Videos für eine Online-Datenschutzschulung. Danach wird in einem Zeitungsartikel über Datenbroker gesprochen, dazu gibt es ein Arbeitsblatt zum Festhalten der wichtigsten Punkte. Es wird auch auf Datenschutzskandale eingegangen, für die es ebenfalls ein Arbeitsblatt gibt, das in Gruppenarbeit bearbeitet wird. Das Thema Datenschutz wird in einem späteren Abschnitt erneut aufgegriffen.",
    "Thema D2: Algorithmischer Bias": "Der Algorithmische Bias bezieht sich auf die möglichen Benachteiligungen, die beim Maschinellen Lernen auftreten können. Dies entsteht oft durch Vorurteile in den Trainingsdaten, die auch vom Algorithmus \"gelernt\" werden. Im Arbeitsblatt Algorithmischer Bias experimentiert man mit der Klassifikation von Bilddaten, um zu verstehen, wann bestimmte Klassen bevorzugt werden. Im TED-Talk von Joy Buolamwini diskutiert man den algorithmischen Bias anhand der Gesichtserkennung und sucht nach Möglichkeiten, den Bias zu reduzieren. Das Arbeitsblatt zum TED-Talk bietet einen Leitfaden für diese Überlegungen. Zusätzlich liest man den KI-Blogeintrag über algorithmische Voreingenommenheit und füllt das entsprechende Arbeitsblatt dazu aus.",
    "Thema D3: Erklärbarkeit": "In diesem Abschnitt geht es um die Erklärbarkeit von neuronalen Netzen. Diese werden oft als Black-Box-Modelle bezeichnet, da sie aufgrund ihrer vielen Parameter schwer zu interpretieren sind. Das kann vor allem bei Fragen der Fairness problematisch sein. Wir vergleichen die begrenzte Interpretierbarkeit von neuronalen Netzen mit linearen Regressionsmodellen und Entscheidungsbäumen. Es stehen Ihnen verschiedene Materialien zur Verfügung, um mehr darüber zu erfahren. Abschließend können Sie Ihr Wissen in Quizzes überprüfen. Dies ist der letzte Abschnitt der ZQ KI und Maschinelles Lernen, nun können Sie zum Abschluss gehen.",
    "Juhu, geschafft!": "Sie haben den Kurs erfolgreich abgeschlossen. Der Kurs wurde im Rahmen des Projekts KI B3 entwickelt, in Zusammenarbeit mit verschiedenen Institutionen und wird vom Bundesministerium für Bildung und Forschung gefördert. Die Ludwig-Maximilians-Universität München begleitet das Projekt und führt Teilnehmerbefragungen durch. Wir würden uns freuen, wenn Sie an der Umfrage teilnehmen würden und Ihre anonymen Logdaten zur Verfügung stellen könnten. Sie dürfen das Kursmaterial weitergeben und weiterverarbeiten, solange die Autor*innennamen angegeben werden. Vielen Dank und viel Erfolg!"
}