{
    "Zusatzqualifikation KI und Maschinelles Lernen": "In diesem Kurs geht es um die Zusatzqualifikation \"KI und Maschinelles Lernen\". Diese wurde vom Bundesministerium für Bildung und Forschung im Rahmen des InnoVET-Programms gefördert. Hier finden Sie alle relevanten Lehrmaterialien für diese Qualifikation. Willkommen!",
    "Spiel zum Einstieg: Bestellen Sie Eis!": "Beim Spiel \"Bestellen Sie Eis!\" helfen Sie der Einzelhandelskauffrau Yvonne dabei, die richtige Menge an Eis zu bestellen. Zu wenig bedeutet weniger Umsatz, zu viel führt zum Wegwerfen. Es gibt drei Gruppen, die unterschiedliche Unterstützung erhalten: Tipps von Expert*innen, Daten früherer Verkäufe oder Übungsmöglichkeiten. Achtung: Die Gruppenauswahl ist endgültig. Für die Folien zum Spielvideo können Sie hier eine Druckversion finden.",   
    "Thema A1-1: Regression": "Es gibt drei Materialien zur Regression: ein Erklärvideo, ein Buch mit integrierten Quizzes und Folien als PDF. Man muss nicht am Spiel \"Bestellen Sie Eis!\" teilgenommen haben, um die Lernmaterialien verstehen zu können. Falls man bereits Kenntnisse über Regression hat, kann man diesen Abschnitt überspringen.",            
    "Thema A1-2: Daten und Wissen": "Der Abschnitt \"Daten und Wissen\" bezieht sich auf das Spiel \"Bestellen Sie Eis\". Es werden drei Gruppen gebeten, die Eisverkäufe zu schätzen. Drei verschiedene Materialien stehen zur Auswahl: ein Erklärvideo, ein Buch mit integrierten Quizfragen und die Folien als PDF. Wenn man sich bereits mit Daten und Wissen auskennt, kann man diesen Abschnitt überspringen.",
    "Thema A2-1: Maschinelles Lernen": "In diesem Abschnitt wird gezeigt, wie das Training eines Modells beim Maschinellen Lernen funktioniert, am Beispiel eines Entscheidungsbaums. Es gibt drei verschiedene Materialien zur Auswahl: ein Erklärvideo, ein Buch mit integrierten Quizzes und Folien als PDF. Wenn du bereits mit Maschinellem Lernen vertraut bist, kannst du diesen Abschnitt überspringen. Im nächsten Abschnitt wird erklärt, wie ein KI-Modell abstraktes Wissen darstellt und wie es auf neue Daten angewendet werden kann, gefolgt von einem Praxisbeispiel zum Trainieren eines Entscheidungsbaums.",
    "Thema A2-2: KI-Modelle": "Der Abschnitt \"KI-Modelle\" erklärt, wie ein trainierter Entscheidungsbaum als abstraktes Wissen dient und wie er auf neue Daten angewandt werden kann. Es gibt drei Materialien zur Auswahl: ein Erklärvideo, ein Buch mit integrierten Quizzes und Folien als PDF. Wenn man bereits mit KI-Modellen vertraut ist, kann dieser Abschnitt übersprungen werden. Danach folgt ein Praxisbeispiel in Gruppenarbeit, das auf den vorherigen Abschnitten aufbaut.",
    "Praxisbeispiel zu den Themen A2-1 und A2-2: Trainieren Sie einen Entscheidungsbaum": "In diesem Abschnitt trainieren Sie in Gruppenarbeit einen Entscheidungsbaum als Klassifikationsmodell, was zu den Themen A2-1 Maschinelles Lernen sowie A2-2 KI-Modelle gehört. Sie verwenden Trainingsdaten und bewerten Ihren Baum anschließend anhand von Testdaten. Weitere Informationen und die genaue Vorgehensweise finden Sie im Arbeitsblatt Training eines Entscheidungsbaums mit den entsprechenden Daten.",
    "Thema A2-3: Trainingsdaten": "In Thema A2-3: Trainingsdaten lernen Sie, woher sie für KI-Modelle stammen und für welche Arten von Maschinellem Lernen sie benötigt werden. Es wird erklärt, was Clustering ist und dass annotierte Daten wertvoll sind. Es gibt drei Materialien zur Auswahl: ein Video, ein Buch und Folien als PDF.",
    "Thema A3: Algorithmen": "Der Abschnitt Thema A3: Algorithmen bietet drei verschiedene Materialien zur Auswahl, nämlich ein Erklärvideo, ein Buch mit integrierten Quizzes und Folien als PDF. Man sollte eines dieser Materialien durcharbeiten, es sei denn man kennt sich bereits mit Algorithmen aus und kann den Abschnitt überspringen.",
    "Thema A4: Beispielanwendungen": "Gehe zuerst auf den KI-Campus, um Informationen über die Anwendungsbereiche von KI im Alltag und in der Industrie 4.0 zu erhalten. Arbeite danach in Gruppen an einem Arbeitsblatt mit echten Beispielen und Use Cases.",
    "Thema A5: Praxisprojekt Teachable Machine": "Gruppen gestalten kleine Projekte mit Googles Teachable Machine und wählen aus drei Szenarien: Objekterkennung in Bildern, Sounderkennung in Audioclips oder Poseerkennung in Bildern. Es werden Bilder oder Audioclips erstellt, um ein KI-Modell zu trainieren. Das Modell wird automatisch erstellt und anschließend getestet. Das Projekt findet in vier Phasen statt: Projekterstellung, erste Modellumsetzung, Verfeinerung und Austausch der Modelle zur Überprüfung der Robustheit.",
    "Thema B1: Daten als Tabellen darstellen": "In diesem Kurs lernen Sie, wie Sie Daten mit Python in Tabellenform darstellen und gezielt auf bestimmte Zeilen, Spalten oder Zellen zugreifen können. Dafür verwenden Sie ein Jupyter Notebook, das Ihnen die notwendigen Python-Befehle und Erklärungen bereitstellt. Sie haben die Wahl zwischen einem Google Colab-Dokument mit Text oder einem Video-Tutorial, sowie dem Herunterladen des Notebooks, falls Sie keinen Google Account besitzen.",
    "Thema B2: Daten in Tabellen analysieren": "In dieser Lektion lernen Sie, Daten in Tabellen mit Python zu analysieren. Sie erfahren, wie Sie Daten in der Tabelle einschränken und grundlegende statistische Funktionen wie den Mittelwert oder die Datenzählung verwenden. Sie können das Jupyter Notebook verwenden, um die Aufgaben zu bearbeiten. Wenn Sie keinen Google-Account haben, können Sie das Notebook auch auf Ihrem eigenen Rechner installieren.",
    "Thema B3: Daten aufbereiten": "In dieser Lektion lernen Sie, wie Sie Daten für Maschinelles Lernen mit Python aufbereiten können. Dabei werden statistische Visualisierungen wie Histogramme und Boxplots verwendet, um Ausreißer zu identifizieren. Des Weiteren lernen Sie, Daten aus verschiedenen Tabellen zu kombinieren. Zur Bearbeitung steht Ihnen entweder ein Jupyter Notebook zur Verfügung (Google Colab) oder Sie können ein Notebook von Github herunterladen. Beachten Sie bitte, dass Sie die Aktivität manuell als erledigt markieren müssen, falls Sie das Notebook von Github nutzen. Zusätzlich besteht die Möglichkeit, sich ein Video anzusehen, in dem ein Statistik-Professor Boxplots, Median und Interquartilsabstand anhand von (fiktiven) Burgerfilialen erklärt: Extra-Video: Boxplots.",    
    "Thema B4: Datensicherheit": "Daten enthalten Wissen und sind oft schwer zu sammeln. Daher ist es wichtig, auf ihre Sicherheit zu achten, damit sie nicht von Unbefugten eingesehen oder beschädigt werden und bei Bedarf verfügbar sind. Phishing-E-Mails und ein laxer Umgang mit Passwörtern sind die größten Risiken für Angriffe von außen. Ein externe Webseite gibt Tipps zum Erkennen von Phishing-E-Mails und eine andere externe Webseite informiert über den Umgang mit Passwörtern. Es gibt auch ein Video, das Hinweise zur Datensicherheit auf privaten Geräten gibt.",            
    "Thema C1-1: Das Koordinatensystem - Was ist wo?": "Das Koordinatensystem ist die Grundlage zur grafischen Darstellung von Daten. Sie haben drei Materialien zur Auswahl: ein Erklärvideo, ein Buch mit integrierten Quizzes und Folien als PDF. Wenn Sie das Koordinatensystem bereits kennen, können Sie den Abschnitt überspringen und mit dem nächsten Thema \"Funktionen\" weitermachen. Quizzes zum Koordinatensystem finden Sie im Buch oder im nächsten Abschnitt.",
    "Thema C1-2: Funktionen": "Dieser Abschnitt behandelt das Thema Funktionen, die die Grundlage für Beziehungen zwischen Daten bilden. Zur Verfügung stehen ein Erklärvideo, ein Buch mit integrierten Quizzes und Folien als PDF für Schnelllerner. Falls man bereits mit Funktionen vertraut ist, kann man diesen Abschnitt überspringen und zum nächsten Thema über lineare Funktionen übergehen. Vorher kann man noch die Quizzes zum Thema Funktionen bearbeiten, die im Buch integriert sind oder auch einzeln im nächsten Abschnitt verfügbar sind.",
    "Thema C1-3: Lineare Funktionen - Steigung": "Es stehen drei Materialien zur Auswahl: ein Erklärvideo, ein Buch mit integrierten Quizzes und die Folien als PDF. Wer bereits mit der Steigung bei linearen Funktionen vertraut ist, kann diesen Abschnitt überspringen und zum nächsten Thema übergehen. Vorher besteht jedoch die Möglichkeit, die Quizzes zum Thema Steigung zu machen.",
    "Thema C1-4: Lineare Funktionen - y-Achsenabschnitt": "Wählen Sie eine der drei Materialien zur Erklärung des y-Achsenabschnitts bei linearen Funktionen aus. Wenn Sie bereits mit dem Thema vertraut sind, können Sie es überspringen. Anschließend können Sie die Quizzes zum Thema machen, entweder im Buch oder im nächsten Abschnitt.",
    "Thema C2-1: Scatterplots": "Der Abschnitt \"Scatterplots\" behandelt die Erstellung von Streudiagrammen. Schau dir zunächst das Erklärvideo oder das Buch an und bearbeite anschließend die Aufgaben im Jupyter Notebook. Die Lösungen kannst du mit den Quizzes überprüfen. Wenn du kein Google-Konto hast, kannst du das Notebook von Github herunterladen. Stelle sicher, dass du vorher die Themen B1, B2 und B3 bearbeitet hast, um dich mit Jupyter Notebooks und der Datenanalyse vertraut zu machen. Die restlichen Materialien kannst du auch ohne diese Themen nutzen.",
    "Thema C2-2: Mittelwert und Standardabweichung": "Mittelwert und Standardabweichung sind zwei wichtige Konzepte. Die Standardabweichung misst die Streuung der Daten um den Mittelwert. Bevor du die Beispiele berechnest und Aufgaben löst, schaue dir das Erklärvideo oder das Buch an. Überprüfe dann deine Lösungen im Quiz. Stelle sicher, dass du mit Jupyter Notebooks und dem Arbeiten mit Daten vertraut bist, bevor du mit diesem Abschnitt beginnst.",
    "Thema C2-3: Korrelation": "Im Abschnitt \"Korrelation\" geht es darum, ob ein Zusammenhang zwischen zwei Variablen besteht und wie dieser gemessen wird. Es wird erklärt, wie lineare Zusammenhänge durch den Korrelationskoeffizienten nach Pearson erfasst werden. In den Videos wird die Berechnung der Kovarianz und des Korrelationskoeffizienten erklärt und auch gezeigt, wie man den Koeffizienten interpretiert. Zudem wird auf das Phänomen eingegangen, dass Korrelationen manchmal zufällig entstehen können und dass Korrelation nicht gleich Kausalität bedeutet.",
    "Thema C3-1: Einfache Lineare Regression": "Der Abschnitt Thema C3-1 behandelt die einfache lineare Regression. Vorab kann man sich ein Erklärvideo oder ein Buch dazu anschauen. Im Jupyter Notebook gibt es dann Beispiele und eine Aufgabe zur Berechnung eines linearen Regressionsmodells. Die Lösung kann durch ein Quiz im nächsten Abschnitt überprüft werden. Das Notebook ist jedoch nur verfügbar, wenn man bereits Erfahrung mit Notebooks hat und das vorherige Notebook zu Thema B3 bearbeitet hat.",
    "Thema C3-2: Multiple Lineare Regression": "Der Abschnitt Thema C3-2 beschäftigt sich mit der Erweiterung der linearen Regression auf mehrere erklärende Variablen, einschließlich kategorialer Variablen, die in Dummy-Variablen umgewandelt werden müssen. Dies wird in einem Erklärvideo und einem Buch erklärt, und es gibt Beispiele und Aufgaben in einem Jupyter Notebook, um das Gelernte anzuwenden. Die Lösungen können im nächsten Abschnitt überprüft werden.",
    "Thema C4-1: Klassifikationsbäume": "In diesem Abschnitt geht es um Klassifikationsbäume, die mithilfe von Maschinellem Lernen aus Daten gelernt wurden. Ziel ist es, den Baum so zu bauen, dass an den Blättern möglichst nur noch Daten einer Klasse vorkommen. Dazu wird der Gini-Index verwendet, um die Diversität der Klassen in jedem Knoten zu bestimmen. Es stehen verschiedene Materialien zur Verfügung, um den theoretischen Teil zu verstehen, und im Anschluss kann man mithilfe eines Jupyter Notebooks selbst einen Klassifikationsbaum erstellen. Die Lösung dazu kann im Quiz überprüft werden.",
    "Thema C4-2: Entropie": "In diesem Abschnitt geht es um die Entropie, ein Maß für \"Unordnung\" oder Unsicherheit, ähnlich dem Gini-Index aus Thema C4-1. In Thema C4-3 wird die Entropie als Maß dafür verwendet, wie viel Information durch einen Klassifikationsbaum gewonnen wird. Es stehen drei Materialien zur Auswahl: ein Video, ein selbst durchklickbares Buch und Folien als PDF.",
    "Thema C4-3: Training von Klassifikationsbäumen": "In diesem Abschnitt geht es darum, wie Klassifikationsbäume trainiert werden. Es wird erklärt, wie der Algorithmus zum Bauen eines Klassifikationsbaums im Detail funktioniert und welche Parameter dabei zu beachten sind, um Overfitting zu vermeiden. Es gibt auch zwei Jupyter Notebooks, in denen die Themen anschaulich veranschaulicht werden. Es wird empfohlen, beide Notebooks durchzuarbeiten. Die Lösungen zu den Aufgaben in den Notebooks finden Sie im nächsten Abschnitt.",
    "Thema C5-1: Evaluationsmaße": "Das Thema Evaluationsmaße behandelt die Bewertung von KI-Modellen, sowohl im Bereich der Klassifikation als auch der Regression. Im Erklärvideo und den Folien erhalten Sie einen Überblick über die Evaluierung beider Arten von Modellen. Anschließend können Sie im Jupyter Notebook selbst Klassifikationsmodelle evaluieren.",
    "Thema C5-2: Training und Test": "In diesem Abschnitt geht es um die Bedeutung der Aufteilung von Daten in Trainings- und Testdaten für eine objektive Evaluierung von KI-Modellen. Es wird erklärt, warum diese Aufteilung wichtig ist und worauf dabei geachtet werden sollte. Nachdem das Notebook \"Aufteilung in Training und Test mit sklearn\" durchgearbeitet wurde, stehen verschiedene Materialien zur Vertiefung des Themas zur Auswahl. Dazu gehören ein Video, ein Buch und Folien als PDF.",
    "Thema C5-3: Cross-Validierung": "Cross-Validierung ist eine Methode zur Evaluierung von KI-Modellen, wenn nur wenig Daten für das Testen zur Verfügung stehen oder wenn die Testdaten zufällig besonders einfach oder schwierig sind. Dabei wird der Datensatz mehrfach in Trainings- und Testsets aufgeteilt, um objektive Ergebnisse zu erhalten. Dieser Prozess ermöglicht es, eine KI-Modellleistung zu bewerten und die Konsistenz der Ergebnisse zu überprüfen.",
    "Thema C6-1: Distanzfunktionen": "In diesem Abschnitt geht es um Distanzfunktionen beim Maschinellen Lernen. Ähnliche Datenpunkte haben ähnliche Eigenschaften und liegen nah beieinander. Die Distanz zwischen den Punkten bestimmt, wie ähnlich sie sind. Es gibt verschiedene Materialien zur Auswahl, um zu lernen, wie man die Distanz zwischen Datenpunkten berechnen kann. Anschließend gibt es praktische Anwendungen in einem Jupyter Notebook, gefolgt von Quizzes zur Vertiefung des Wissens.",
    "Thema C6-2: Instanzbasiertes Lernen": "Instanzbasiertes Lernen nutzt die Ähnlichkeit von Datenpunkten, um Vorhersagen zu treffen. Dabei werden ähnliche Datenpunkte in den Trainingsdaten identifiziert und für die Vorhersage genutzt. Ein Beispiel dafür ist die Nächste-Nachbarn-Klassifikation bzw. Regression. In den verlinkten Ressourcen können Sie mehr über instanzbasiertes Lernen erfahren und die Nächste-Nachbarn-Klassifikation/regression mit sklearn ausprobieren.",
    "Thema C7-1: Neuronen": "In diesem Abschnitt wird das Thema Neuronen eingeführt und der Zusammenhang zur linearen Regression hergestellt. Es werden der Aufbau von Neuronen und ihre Verbindung zu neuronalen Netzen behandelt. Sie können zwischen einem Video, einem Buch oder den Folien als PDF wählen, um weitere Informationen zu erhalten.",
    "Thema C7-2: Aktivierungsfunktionen": "In diesem Abschnitt werden gängige Aktivierungsfunktionen in neuronalen Netzen behandelt. Es stehen drei Optionen zur Verfügung, um sich über das Thema zu informieren: ein Erklärvideo, ein Buch oder Folien als PDF. Man kann sich für eine der drei Varianten entscheiden oder das Thema überspringen, wenn man es bereits beherrscht.",
    "Thema C7-3: Parameter in Neuronalen Netzen": "In diesem Abschnitt wird erklärt, welche Parameter bei der Training eines Neuronalen Netzes gelernt werden müssen. Dabei wird auch der Begriff \"Forward Pass\" eingeführt, bei dem die Vorhersagen des Netzes für einen gegebenen Input berechnet werden. Es werden verschiedene Materialien zum Thema angeboten, aber wenn man das Thema bereits gut kennt, kann man es auch überspringen.",
    "Thema C7-4: Training von Neuronalen Netzen": "Im Abschnitt Thema C7-4 geht es darum, wie neuronale Netze trainiert werden. Das Ziel des Trainings ist es, die Gewichte der neuronalen Verbindungen so anzupassen, dass das Netz \"gut genug\" ist. Es werden auch weitere Parameter, die sogenannten Hyperparameter, beim Training berücksichtigt. Es gibt verschiedene Materialien, um mehr über das Training und die Hyperparameter zu erfahren, sowie Quizzes zum Thema.",
    "Thema C7-5: Verlustfunktion": "In diesem Abschnitt lernen Sie, welche Verlustfunktionen beim Training von neuronalen Netzen verwendet werden können und wie man ihre Gradienten für die Parameter berechnet. Es stehen Ihnen verschiedene Ressourcen zur Verfügung, darunter ein Video, ein Buch und Folien als PDF. Im nächsten Abschnitt finden Sie Quizzes zum Thema Verlustfunktion.",
    "Thema C7-6: Netzwerkarchitekturen": "In diesem Abschnitt werden verschiedene komplexere Architekturen von neuronalen Netzen vorgestellt, wie RNNs, LSTMs und die Encoder-Decoder-Architektur. Diese gelten als leistungsfähige Architekturen, die weniger ressourcenintensiv sind als die Transformer-Architektur. Es gibt weiterführende Materialien und Quizzes, um das Gelernte zu vertiefen, bevor es im nächsten Abschnitt um Datenschutz geht.",
    "Thema D1: Datenschutz": "Im Abschnitt Thema D1: Datenschutz geht es darum, den Datenschutz für Verbraucher zu verstehen und zu schätzen. Es werden mehrere Videos und Arbeitsblätter bereitgestellt, um die europäischen Datenschutzregeln sowie den Wert von Daten und Datenschutzskandale zu erkunden. Das Thema Datenschutz wird später im Abschnitt Thema D2: Algorithmischer Bias erneut aufgegriffen.",
    "Thema D2: Algorithmischer Bias": "Im Abschnitt \"Algorithmischer Bias\" geht es um die Entstehung von Benachteiligungen bei maschinellem Lernen aufgrund von Vorurteilen in den Trainingsdaten. Es wird zunächst ein Experiment mit einem Teachable Machine-Projekt gemacht, um zu sehen, wann bestimmte Klassen bevorzugt werden. Anschließend wird der algorithmische Bias anhand eines TED-Talks über Gesichtserkennung diskutiert und Möglichkeiten zur Reduzierung des Bias werden erörtert. Zum Abschluss wird ein KI-Blogeintrag zum Thema algorithmische Voreingenommenheit gelesen und ein Arbeitsblatt dazu ausgefüllt.",
    "Thema D3: Erklärbarkeit": "Neuronale Netze werden oft als Black-Box-Modelle bezeichnet, da sie aufgrund der vielen Parameter schwer zu interpretieren sind. Im Abschnitt Thema D3: Erklärbarkeit vergleichen wir die begrenzte Interpretierbarkeit von neuronalen Netzen mit linearen Regressionsmodellen und Entscheidungsbäumen. Weitere Materialien stehen zur Verfügung, inklusive eines Videos, eines Buchs und Folien als PDF. Im Abschnitt Quizzes zum Thema D3: Erklärbarkeit können Sie Ihr Verständnis überprüfen. Dies war der letzte Abschnitt der ZQ KI und Maschinelles Lernen. Gehen Sie zum Abschluss zum Abschnitt \"Juhu, geschafft!\"",
    "Juhu, geschafft!": "Sie haben den Kurs erfolgreich abgeschlossen. Es wurde in Zusammenarbeit mit verschiedenen Institutionen entwickelt und vom Bundesministerium für Bildung und Forschung gefördert. Die Universität München begleitet das Projekt und bittet um eine Teilnahme an einer Befragung zur Verbesserung des Kurses. Zusätzlich dürfen Sie das Kursmaterial weitergeben und verwenden, unter der Bedingung, die Autor*innennamen anzugeben und die Lizenzhinweise zu beachten. Vielen Dank für Ihre Teilnahme und viel Erfolg für die Zukunft!"
}